Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Having a Kubernetes Client extension in Quarkus is very useful in order to unlock the power of Kubernetes Operators. Kubernetes Operators are quickly emerging as a new class of Cloud Native applications. These applications essentially watch the Kubernetes API and react to changes on various resources and can be used to manage the lifecycle of all kinds of complex systems like databases, messaging systems and much much more. Being able to write such operators in Java with the very low footprint that native images provide is a great match.
ja_jp: Kubernetes Operatorsのパワーを引き出すためには、QuarkusにKubernetesクライアントエクステンションがあると非常に便利です。Kubernetes Operatorsは、クラウドネイティブアプリケーションの新しい種類として急速に台頭してきています。これらのアプリケーションは、基本的にKubernetes APIを監視し、様々なリソースの変更に反応し、データベースやメッセージングシステムなど、あらゆる種類の複雑なシステムのライフサイクルを管理するために使用することができます。ネイティブイメージが提供する非常に低いフットプリントで、このようなOperatorをJavaで書くことができるということは、非常にマッチしています。

source: Having a peak of resource consumption at bootstrap: in a constrained environment, you will need to size the needed resources based on your technical bootstrap needs rather than your actual business needs.
ja_jp: ブートストラップでリソース消費のピークを持つ: 制約のある環境では、実際のビジネスニーズではなく、技術的なブートストラップのニーズに基づいて、必要なリソースのサイズを決定する必要があります。

source: Having access to an Azure subscription. https://azure.microsoft.com/free/?WT.mc_id=opensource-quarkus-brborges[Get a free one here]
ja_jp: Azureのサブスクリプションにアクセスできること。 https://azure.microsoft.com/free/?WT.mc_id=opensource-quarkus-brborges[無料のものはこちら]

source: Having completed the xref:getting-started-testing.adoc[Testing your application guide]
ja_jp: xref:getting-started-testing.adoc[アプリケーションのテストガイド] が完了済であること

source: Having defined the schema, we can now jump to implementing the `MovieResource`.
ja_jp: スキーマを定義したら、`MovieResource` を実装できます。

source: Having it, you can run the dev mode with: `mvn quarkus:dev -Pdevelopment`.
ja_jp: これがあれば、次のようにしてDevモードを実行できます： `mvn quarkus:dev -Pdevelopment`

source: Having multiple JSON (or XML) format mappers registered for the same persistence unit will result in an exception, because of the ambiguity.
ja_jp: 同じ永続化ユニットに複数の JSON (または XML) 形式マッパーを登録すると、あいまいさのために例外が発生します。

source: Having prepared the code, you configure the application:
ja_jp: コードを準備したら、アプリケーションを設定します。

source: Having such property groups brings more structure to your configuration. This is especially useful when then number of properties grows.
ja_jp: このようなプロパティグループによって、設定にさらなる構造をもたらします。これは、プロパティの数が増えてきたときに特に有効です。

source: Having the same session cookie path when multiple OIDC `web-app` tenants protect the tenant-specific paths is not recommended and should be avoided as it requires even more care from the custom resolvers, for example:
ja_jp: 複数の OIDC `web-app` テナントがテナント固有のパスを保護するときに同じセッション Cookie パスを持つことは推奨されず、避ける必要があります。 これは、カスタムリゾルバーがさらに注意する必要があるためです。例:

source: Having this configuration means that all requests performed using `ExtensionsService` will use `https://stage.code.quarkus.io` as the base URL. Using the configuration above, calling the `getById` method of `ExtensionsService` with a value of `io.quarkus:quarkus-rest-client` would result in an HTTP GET request being made to `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client`.
ja_jp: この設定をすると、 `ExtensionsService` を使用して実行されるすべてのリクエストが `https://stage.code.quarkus.io` をベースURLとして使用します。上記の設定を使用して、 `ExtensionsService` の `getById` メソッドを `io.quarkus:quarkus-rest-client` の値で呼び出すと、HTTP GET リクエストが `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client` に対して実行されます。

source: Having this configuration means that all requests performed using `ExtensionsService` will use `https://stage.code.quarkus.io` as the base URL. Using the configuration above, calling the `getById` method of `ExtensionsService` with a value of `io.quarkus:quarkus-resteasy-client` would result in an HTTP GET request being made to `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client`.
ja_jp: この設定をすると、 `ExtensionsService` を使って実行されるすべてのリクエストは、ベースURLとして `https://stage.code.quarkus.io` をベース URL として使用することを意味します。 上記の設定を使うと、 `io.quarkus:quarkus-resteasy-client` の値で `ExtensionsService` の `getById` メソッドを呼び出すと、HTTP GET リクエストは次のようになります。 `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client` .

source: Having this configuration means that all requests performed using `org.acme.rest.client.ExtensionsService` will use `https://stage.code.quarkus.io/api` as the base URL. Using the configuration above, calling the `getById` method of `ExtensionsService` with a value of `io.quarkus:quarkus-rest-client-reactive` would result in an HTTP GET request being made to `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client-reactive`.
ja_jp: この設定を行うと、 `org.acme.rest.client.ExtensionsService` を使用して実行されるすべてのリクエストは、ベース URL として `https://stage.code.quarkus.io/api` を使用することを意味します。上記の設定を使用すると、 `ExtensionsService` の `getById` メソッドを `io.quarkus:quarkus-rest-client-reactive` という値で呼び出すと、 `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client-reactive` に HTTP GET リクエストが行われることになります。

source: Having this configuration means that all requests performed using `org.acme.rest.client.ExtensionsService` will use `https://stage.code.quarkus.io/api` as the base URL. Using the configuration above, calling the `getById` method of `ExtensionsService` with a value of `io.quarkus:quarkus-rest-client` would result in an HTTP GET request being made to `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client`.
ja_jp: この設定を行うと、 `org.acme.rest.client.ExtensionsService` を使用して実行されるすべてのリクエストは、ベース URL として `https://stage.code.quarkus.io/api` を使用することを意味します。 上記の設定を使用すると、 `ExtensionsService` の `getById` メソッドを `io.quarkus:quarkus-rest-client` という値で呼び出すと、 `https://stage.code.quarkus.io/api/extensions?id=io.quarkus:quarkus-rest-client` に HTTP GET リクエストが行われることになります。

source: Having this configuration means that all requests performed using `org.acme.rest.client.multipart.MultipartService` will use `http://localhost:8080/ ` as the base URL.
ja_jp: この設定をすると、 `org.acme.rest.client.multipart.MultipartService` を使って実行されるすべてのリクエストは、ベースURLとして `http://localhost:8080/` を使用することになります。

source: Having this configuration means that all requests performed using `org.acme.rest.client.multipart.MultipartService` will use `http://localhost:8080/` as the base URL.
ja_jp: この設定を行うと、 `org.acme.rest.client.multipart.MultipartService` を使用して実行されるすべてのリクエストは、 `http://localhost:8080/` をベースURLとします。

source: Having this configuration means that the default scope of `ExtensionsService` will be `@Singleton`. Supported scope values are `@Singleton`, `@Dependent`, `@ApplicationScoped` and `@RequestScoped`. The default scope is `@Dependent`. The default scope can also be defined on the interface.
ja_jp: この設定をすると、 `ExtensionsService` のデフォルトのスコープは `@Singleton` になります。サポートされているスコープの値は `@Singleton` , `@Dependent` , `@ApplicationScoped` および `@RequestScoped` です。既定のスコープは `@Dependent` です。デフォルトのスコープはインターフェイス上で定義することもできます。

source: Having to configure required origins when you start developing a Quarkus application requiring CORS support can be difficult and, in such cases, you may want to allow all origins in dev mode only in order to focus on the actual development first:
ja_jp: CORSサポートが必要なQuarkusアプリケーションの開発を開始する際に、必要なオリジンを設定するのは困難です。このような場合、まず実際の開発に集中するために、すべてのオリジンを開発モードでのみ許可したいでしょう。

source: Header
ja_jp: ヘッダ

source: Header information about your API.
ja_jp: APIに関するヘッダー情報

source: Headless AWT on Windows for native images
ja_jp: ネイティブイメージでのWindowsにおけるヘッドレスAWT

source: Headless graphics, PDF documents, QR code images etc. manipulation is natively supported on amd64/aarch64 Linux only. Neither Windows nor MacOS are supported and require running the application in a Linux container.
ja_jp: ヘッドレスグラフィックス、PDF ドキュメント、QR コード画像などの操作は、amd64/aarch64 Linux のみでネイティブにサポートされています。Windows も MacOS もサポートされておらず、Linux コンテナーでアプリケーションを実行する必要があります。

source: Health Check
ja_jp: ヘルスチェック

source: Health Checks
ja_jp: ヘルスチェック

source: Health checks are provided via the `quarkus-smallrye-health` extension. It provides both liveness and readiness checks capabilities.
ja_jp: ヘルスチェックは `quarkus-smallrye-health` のエクステンションを介して提供されます。これは、livenessとreadinessのチェック機能の両方を提供します。

source: Health reporting
ja_jp: ヘルスレポート

source: Health status change observers
ja_jp: ヘルスステータス変化オブザーバー

source: Heap space
ja_jp: ヒープ空間

source: Hear from developers about their successes and challenges when using Quarkus in real-world applications to meet business requirements.
ja_jp: ビジネス要件を満たすために実際のアプリケーションで Quarkus を使用したときの成功と課題について、開発者から聞いてみましょう。

source: Hello Qute and REST
ja_jp: Hello Qute と REST

source: Hello World Example
ja_jp: ハローワールドの例

source: Hello World with JAX-RS
ja_jp: JAX-RS で Hello World

source: Hello World with Jakarta REST
ja_jp: Jakarta RESTでHello World

source: Help us make Quarkus even better, anonymously.
ja_jp: 匿名で、Quarkusをより良いものにするためにご協力ください。

source: Help with the migration
ja_jp: 移行のサポート

source: Here `Message` properties class is defined as an inner class, but it could also be a top level class.
ja_jp: ここでは `Message` プロパティクラスはインナークラスとして定義されていますが、トップレベルのクラスとすることも出来ます。

source: Here `text` field is public, but it could also be a private field with getter and setter or just a public getter in an interface. Because `text` does not have a default value it is considered required and unless it is defined in a configuration file (`application.properties` by default) your application will fail to start. Define this property in your `src/main/resources/application.properties` file:
ja_jp: ここでは `text` フィールドはパブリックですが、ゲッターとセッターを持つプライベートフィールドや、インターフェイス内の単なるパブリックゲッターにすることもできます。 `text` にはデフォルト値がないため、必須とみなされ、設定ファイル（デフォルトでは `application.properties` ）に定義されていないと、アプリケーションの起動に失敗します。 `src/main/resources/application.properties` ファイルでこのプロパティを定義してください:

source: Here again, it checks that the appropriate OpenJDK is available on the target system. Then we ensure that the required user and group exist on the target. This is recommended mostly to be able to run the Quarkus app with a regular user, rather than with the root account.
ja_jp: ここでも、適切なOpenJDKがターゲット・システム上で利用可能かどうかをチェックします。次に、必要なユーザーとグループがターゲットに存在するようにします。これは主に、Quarkusアプリをrootアカウントではなく、一般ユーザーで実行できるようにするために推奨されます。

source: Here again, we use the same `@io.quarkus.hibernate.orm.PersistenceUnit` annotation.
ja_jp: ここでも同じ `@io.quarkus.hibernate.orm.PersistenceUnit` アノテーションを使用しています。

source: Here are four options which you may want to consider, and we will continue expanding this list.
ja_jp: 検討に値する 4 つのオプションを以下に示します。今後もこのリストを拡張していく予定です。

source: Here are some examples of these methods:
ja_jp: これらの方法の例をいくつか示します。

source: Here are some highlights.
ja_jp: 以下はそのハイライトです。

source: Here are some more advanced topics that you may not need to know about initially, but could prove useful for more complex use cases.
ja_jp: ここでは、最初は知る必要がないかもしれませんが、より複雑なユースケースに役立つ可能性のある、より詳細なトピックをいくつか紹介します。

source: Here are some pointers on how to achieve those capabilities.
ja_jp: これらの機能を実現する方法についていくつかのヒントを紹介します。

source: Here are some query examples:
ja_jp: クエリの例を紹介します。

source: Here are the benefits of performing rendering work on the server:
ja_jp: サーバー上でレンダリング作業を実行する利点は次のとおりです。

source: Here are the default configuration values:
ja_jp: デフォルトの設定値は以下の通りです。

source: Here are the most common formats:
ja_jp: 最も一般的なフォーマットは以下の通りです。

source: Here are the roles of each ClassLoader:
ja_jp: 各ClassLoaderの役割は以下の通りです:

source: Here are the rules governing execution:
ja_jp: 実行に関するルールは次のとおりです。

source: Here are two examples:
ja_jp: 2 つの例があります。

source: Here instead of using the `LoanAppDto` that we introduced to marshall/unmarshall the JSON requests we are binding directly the class representing the rule unit. The two relevant differences are that it implements the `RuleUnitData` interface and uses a `DataStore` instead of a plain `List` containing the loan applications to be approved. The first is just a marker interface to notify the engine that this class is part of a rule unit definition. The use of a `DataStore` is necessary to let the rule engine to react accordingly to the changes by firing new rules and triggering other rules. In the example, the consequences of the rules modify the approved property of the loan applications. Conversely, the `maxAmount` value can be considered a configuration parameter of the rule unit and left as it is: it will automatically be processed during the rules evaluation with the same semantic of a global, and automatically set from the value passed by the JSON request as in the first example, so you will still be allowed to use it in your rules.
ja_jp: ここでは、JSONリクエストのマーシャリング/アンマーシャリングに導入した `LoanAppDto` を使用するのではなく、ルールユニットを表すクラスを直接バインドしています。2つの重要な違いは、このクラスが `RuleUnitData` インターフェイスを実装していること、そして、承認対象のローン申請を含む単純な List の代わりに DataStore を使用していることです。前者は、このクラスがルールユニット定義の一部であることをエンジンに通知するための単なるマーカーインターフェイスです。 `DataStore` は、ルールエンジンが変更に応じて適切に反応し、新しいルールを実行したり、他のルールをトリガーしたりできるように使用する必要があります。この例では、ルールの結果としてローン申請の `approved` プロパティーが変更されます。逆に、 `maxAmount` の値はルールユニットの設定パラメーターと見なすことができ、そのままにできます。これは、ルール評価中にグローバルと同じセマンティクスで自動的に処理され、最初の例のように JSONリクエストによって渡された値から自動的に設定されるため、引き続きルールで使用できます。

source: Here is a complete list of choices for a registry's `update-policy` value:
ja_jp: 以下がレジストリの `update-policy` の値の選択肢の完全なリストです:

source: Here is a configuration example exposing the management interface on _https://localhost:9002_:
ja_jp: ここでは、_https://localhost:9002_ で、マネジメントインタフェースを公開する設定例を示します:

source: Here is a list of entity supertypes you can use and the ID type they provide, but keep in mind you do not have to extend any of these types if you define you own ID:
ja_jp: 使用できるエンティティのスーパークラスとその提供する ID 型のリストを次に示しますが、独自の ID を定義する場合はこれらの型のいずれかを拡張する必要がないことに注意してください。

source: Here is a list of system properties the Quarkus bootstrap Maven resolver checks during its initialization.
ja_jp: 以下は、Quarkus bootstrap Maven resolverが初期化時にチェックするシステムプロパティのリストです。

source: Here is a related fragment of the configuration:
ja_jp: 関連する設定フラグメントを次に示します。

source: Here is a sample of a root `build.gradle` file:
ja_jp: 以下は、ルート `build.gradle` ファイルのサンプルです。

source: Here is a sample where `ContextAwareScheduler` is used:
ja_jp: 以下は `ContextAwareScheduler` が使用されているサンプルです。

source: Here is a simple example of a Qute template:
ja_jp: 以下は Qute テンプレートの簡単な例です。

source: Here is a simple example:
ja_jp: 簡単な例を挙げてみます。

source: Here is a step-by-step guide to write an extension codestart. You may also watch the https://www.youtube.com/watch?v=lLyVDqVK8cE[Quarkus Insight #99] with a live-coding session.
ja_jp: 以下は、エクステンション Codestart を作成するためのステップバイステップのガイドです。 https://www.youtube.com/watch?v=lLyVDqVK8cE[Quarkus Insight #99] のライブコーディングセッションもご覧ください。

source: Here is a table listing all the options you have for your entity and repository supertypes, depending on which model of operation you prefer, and which ID type you want. Remember you don't have to extend `WithId<Id>` if you define your own ID entity field:
ja_jp: ここに、操作モデルの好みと必要な ID の型に応じて、エンティティおよびリポジトリのスーパータイプとして利用できるすべてのオプションをリストした表があります。独自の ID エンティティフィールドを定義する場合、`WithId<Id>` を拡張する必要がないことを覚えておいてください。

source: Here is a typical configuration property commented with Asciidoc:
ja_jp: 以下は、Asciidocでコメントされた典型的な設定プロパティです。

source: Here is a version of the `FruitService` using the Elasticsearch Java Client instead of the low level one:
ja_jp: ここでは、低レベルのものではなく、Elasticsearch Java Client を使用したバージョンの `FruitService` を紹介します:

source: Here is a version of the `FruitService` using the high level client instead of the low level one:
ja_jp: ここでは、低レベルのクライアントの代わりに高レベルのクライアントを使用したバージョンの `FruitService` を示します。

source: Here is a video presenting Continuous Testing in motion:
ja_jp: ここでは、継続的テストの動作を紹介するビデオを紹介します。

source: Here is an example `info` output for a simple project:
ja_jp: 単純なプロジェクトの `info` 出力の例を以下に示します。

source: Here is an example configuration for enabling mTLS:
ja_jp: mTLS を有効にするための設定例を次に示します。

source: Here is an example from the Dev Services deployment module:
ja_jp: 以下は、Dev Services デプロイメントモジュールの例です。

source: Here is an example of `build.gradle` file for the `runtime` module:
ja_jp: 以下は、 `runtime` モジュール用の `build.gradle` ファイルの例です:

source: Here is an example of a `@PermissionChecker` method that checks the `say-hello` permission based on a user principal, custom header and query parameter:
ja_jp: 以下は、ユーザープリンシパル、カスタムヘッダー、クエリーパラメーターに基づいて `say-hello` 権限をチェックする `@PermissionChecker` メソッドの例です。

source: Here is an example of a `FrancophoneService` which methods are traced.
ja_jp: ここでは、メソッドがトレースされている `FrancophoneService` の例を示します。

source: Here is an example of a build step that persists context across live reloads:
ja_jp: 以下は、ライブリロード間でコンテキストを保持するビルドステップの例です。

source: Here is an example of a custom function contributor:
ja_jp: カスタム関数コントリビューターの例です。

source: Here is an example of cache metrics available for an application that depends on the `quarkus-micrometer-registry-prometheus` extension:
ja_jp: 以下は、 `quarkus-micrometer-registry-prometheus` エクステンションに依存するアプリケーションで利用可能なキャッシュメトリクスの例です。

source: Here is an example of filtering out heartbeat events:
ja_jp: 以下はハートビートイベントをフィルタリングする例です。

source: Here is an example of how the preceding classes should be changed:
ja_jp: ここでは、先述のクラスをどのように変更するかの例を示します:

source: Here is an example of how to configure a Quarkus application to initiate a logout flow:
ja_jp: ログアウトフローを開始するように Quarkus アプリケーションを設定する方法の例を次に示します。

source: Here is an example of how to configure an RP initiated logout flow:
ja_jp: RP によって開始されるログアウトフローを設定する方法の例を次に示します。

source: Here is an example of the Flyway SQL (`V1.0.0__create_fruits.sql`) to be created in the configured folder `src/main/resources/schema`.
ja_jp: ここでは、設定されたフォルダー `src/main/resources/schema` に作成される Flyway SQL ( `V1.0.0__create_fruits.sql` ) の例を示します。

source: Here is an example of the Quarkus REST (formerly RESTEasy Reactive) custom filter:
ja_jp: 以下は、Quarkus REST (旧称 RESTEasy Reactive) カスタムフィルターの例です。

source: Here is an example of the RESTEasy Classic custom filter:
ja_jp: 以下は、RESTEasy Classic カスタムフィルターの例です。

source: Here is an example of the liveness check:
ja_jp: Liveness チェックの一例をご紹介します:

source: Here is an example of the readiness check:
ja_jp: ここでは、Rediness チェックの一例をご紹介します:

source: Here is an example of the usage of the flush method to allow making a specific action in case of `PersistenceException`:
ja_jp: ここでは `PersistenceException` が発生した場合に特定の動作を行えるようにするための flush メソッドの使用例を示します:

source: Here is an example of using a `MongoCollection` with the `FruitCodec`.
ja_jp: これが、 `MongoCollection` を `FruitCodec` と使用する例です。

source: Here is an example on how it should look like:
ja_jp: 以下は、その例です:

source: Here is an example setlist for a tour stop.
ja_jp: ここでは、あるツアーのセットリストの例をご紹介します。

source: Here is an example use case to customize the `com.fasterxml.jackson.databind.ObjectWriter`:
ja_jp: 以下は、 `com.fasterxml.jackson.databind.ObjectWriter` をカスタマイズするユースケースです。

source: Here is an example use case:
ja_jp: ユースケースの例を次に示します。

source: Here is an example using _sendgrid_:
ja_jp: ここでは _sendgridを_ 使用した例を示します。

source: Here is an implementation example of a `TenantConnectionResolver` implementation using standard Quarkus technologies – Agroal for pooling and Narayana for transactions:
ja_jp: ここでは、Quarkusの標準的なテクノロジーであるプーリング用のAgroalとトランザクション用のNarayanaを使用した、 `TenantConnectionResolver` の実装例を紹介します：

source: Here is another example showing how to use the client certificate available in the current xref:security-authentication-mechanisms.adoc#mutual-TLS-authentication[mutual TLS (mTLS) authentication] request to add more roles:
ja_jp: 以下は、現在の xref:security-authentication-mechanisms.adoc#mutual-TLS-authentication[相互TLS（mTLS）認証] リクエストで使用可能なクライアント証明書を使用して、さらにロールを追加する方法を示す別の例です：

source: Here is another example showing how to use the client certificate available in the current xref:security-authentication-mechanisms.adoc#mutual-tls[mutual TLS (mTLS) authentication] request to add more roles:
ja_jp: 以下に、現在の xref:security-authentication-mechanisms.adoc#mutual-tls[相互 TLS (mTLS) 認証] リクエストで使用可能なクライアント証明書を使用して、さらにロールを追加する方法を示す別の例を示します：

source: Here is another example showing how to use the client certificate available in the current xref:security-built-in-authentication-support-concept.adoc#mutual-tls[Mutual TLS] request to add more roles:
ja_jp: これは、現在の link:security-built-in-authentication.html#mutual-tls[相互TLS]リクエストで利用可能なクライアント証明書を使用して、さらにロールを追加する方法を示す別の例です。 :

source: Here is another example showing how to use the client certificate available in the current xref:security-built-in-authentication.adoc#mutual-tls[Mutual TLS] request to add more roles:
ja_jp: ここでは、現在の link:security-built-in-authentication.html#mutual-tls[相互TLS]リクエストで利用可能なクライアント証明書を使用して、さらにロールを追加する方法を示す別の例を示します。 :

source: Here is how `OidcClient` can be configured to use the `client_credentials` grant:
ja_jp: `OidcClient` が `client_credentials` グラントを使用するように設定する方法は以下の通りです。

source: Here is how `OidcClient` can be configured to use the `password` grant:
ja_jp: `OidcClient` が `password` グラントを使用するように設定する方法は以下の通りです。

source: Here is how to set the intended token recipient by using the `audience` parameter:
ja_jp: ここでは、 `audience` パラメーターを使用して、トークンの受信者を設定する方法を説明します。

source: Here is how we measure startup time in our tests.
ja_jp: ここでは、テストにおける起動時間の測定方法を説明します。

source: Here is how you can integrate `quarkus-oidc` with GitHub after you have link:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[created a GitHub OAuth application]. Configure your Quarkus endpoint like this:
ja_jp: link:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[GitHub OAuth アプリケーションを作成した] 後に、 `quarkus-oidc` を GitHub と統合する方法を説明します。Quarkus のエンドポイントをこのように設定します。

source: Here is how you can integrate `quarkus-oidc` with `GitHub` after you have link:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[created a GitHub OAuth application]. Configure your Quarkus endpoint like this:
ja_jp: ここでは、 link:https://docs.github.com/en/developers/apps/building-oauth-apps/creating-an-oauth-app[GitHub OAuthアプリケーションを作成] した後、 `quarkus-oidc` と `GitHub` を統合する方法を説明します。Quarkusのエンドポイントをこのように設定します:

source: Here is how you would define access to a database with no built-in support (in JVM mode):
ja_jp: ここでは、組み込みサポートのないデータベースへのアクセスを定義する方法を説明します (JVMモードで)。

source: Here is how you would use the OpenTracing driver:
ja_jp: ここでは、OpenTracing ドライバーをどのように使用するかを説明します。

source: Here is the Marshaller class for our Author & Book classes.
ja_jp: こちらは、Author と Book クラスのマーシャラクラスです。

source: Here is the list of all the Quarkus Maven Plugin goals:
ja_jp: Quarkus Maven Pluginのすべてのゴールのリストはこちらです:

source: Here is the list of available brotli4j artifacts for the different platforms:
ja_jp: さまざまなプラットフォームで利用可能な brotli4j アーティファクトのリストは次のとおりです。

source: Here is the list of extensions that we happened to use: `cdi, config-yaml, freemarker, hibernate-validator, kubernetes-client, openshift-client, rest-client, restclient-jackson, vault` (plus internal extensions for SMBJ and our internal centralized logging system).
ja_jp: 時々使用していたエクステンションのリストは以下の通りです。 `cdi, config-yaml, freemarker, hibernate-validator, kubernetes-client, openshift-client, rest-client, restclient-jackson, vault` (加えて、SMBJと私たちの内部集中型ログシステムのための内部エクステンション)。

source: Here is the normalizer used for sorting. Very similar to our first analyzer, except we don't tokenize the words as we want one and only one token.
ja_jp: ここではソートに使われるノーマライザーを紹介します。最初のアナライザーと非常によく似ていますが、1つだけのトークンが欲しいので、単語をトークン化しないことを除けば同じです。

source: Here receive the films as a batch, allowing you to fetch the corresponding heroes.
ja_jp: ここでは、映画を一括して受け取ることで、対応するヒーローを取り出すことができます。

source: Here return a Flow.Publisher<String> that will stream the log
ja_jp: ここでは、ログをストリーミングする `Flow.Publisher<String>` を返します。
